[
  "Department of Electrical Engineering - Introduction: : The Department of Electrical Engineering was established in 1923 as a part of the Maclagan Engineering College. The Department started a postgraduate program in 1966. It currently offers Ph.D. and M.Sc. degrees in Electrical Engineering and M.Sc. in Artificial Intelligence. The first Master's degree was awarded in 1969 and the first Doctoral degree in 1979.",
  "Department of Electrical Engineering - Offered Programs: : • Ph.D. Electrical Engineering • M.Sc. Electrical Engineering • M.Sc. Artificial Intelligence",
  "Department of Electrical Engineering - Eligibility Criteria: : • M.Sc. Electrical Engineering: Bachelor’s degree in electrical engineering, Telecommunication Engineering, Electronics Engineering, Computer Engineering, Computer (System) Engineering, Mechatronics Engineering, Biomedical Engineering, or Telecommunication System Engineering from a PEC accredited program. • M.Sc. Artificial Intelligence: Bachelor's degree in Artificial Intelligence (or equivalent), Computer Science (or equivalent), Information Technology, Electrical Engineering, Computer Engineering, Mechatronics Engineering, Computer Systems Engineering, or B.S./B.Sc. in a relevant discipline as determined by PGRC, or M.Sc. (16 years) in Computer Science or Information Technology. • Ph.D.: 18-years MS/M.Sc./M.Phil. degree in relevant discipline with min CGPA 3.0/4.0 or 60% marks.",
  "Department of Electrical Engineering - Faculty Members: : • Professors: o Dr. Muhammad Shoaib (Dean) o Dr. Muhammad Tahir (Chairman) o Dr. Haroon Attique Babri (Emeritus) o Dr. Shahid Hussain Bokhari (Emeritus) o Dr. Muhammad Asghar Saqib o Dr. Kashif Javed o Dr. Muhammad Aamer Iqbal Bhatti o Dr. Syed Abdul Rahman Kashif o Dr. Farhan Mahmood • Associate Professors: o Dr. Asim Loan 5 o Dr. Irfan Ullah Chaudhary o Dr. Umar T Shami o Dr. Rabia Nazir o Dr. Ahsen Tahir o Dr. Ubaid Ullah Fayyaz o Dr. Haroon Farooq (RCET Campus) o Dr. Waqas Tariq Toor (Narowal Campus) • Assistant Professors: o Dr. Nauman Ahmed o Dr. Syed Shah Irfan Hussain o Dr. Naveed Nawaz o Dr. Adeem Aslam o Dr. Omer Lateef o Dr. Farooq Ahmad o Dr. Salman Fakhar o Dr. Suleman Sami Qazi o Dr. Muhammad Imran Javed o Dr. Naveed Akhtar (RCET Campus) o Dr. Rana Tariq Mehmood Ahmad (Narowal Campus)",
  "Department of Computer Science - Introduction: : The Department of Computer Science is one of the prominent and oldest centers of computer education in the country. Its history dates back to 1968 when UET Lahore established a Computer Center under the supervision of the Department of Mathematics. A Bachelor degree program was started in 1976, upgraded to M.Sc. in 1978 (the first graduate program of the country in computer science). The center became an independent Department of Computer Science in 1991.",
  "Department of Computer Science - Offered Programs: : • Ph.D. Computer Science • M.Sc. Computer Science • M.Sc. Software Engineering • M.Sc. Data Science (via Institute of Data Science, see 1.3) 6",
  "Department of Computer Science - Eligibility Criteria: : • M.Sc. Computer Science: Sixteen-year education with terminal degree in Computing (any related domains) or terminal degree suitable for Computer Science. Suitability determined by PGRC. • M.Sc. Software Engineering: Sixteen-year education with terminal degree in Computing (any related domains) or terminal degree suitable for Software Engineering. Suitability determined by PGRC. • Ph.D.: 18-years MS/M.Sc./M.Phil. degree in relevant discipline with min CGPA 3.0/4.0 or 60% marks.",
  "Department of Computer Science - Faculty Members: : • Professors: o Dr. Muhammad Shoaib (Dean) o Dr. Usman Ghani Khan (Chairman) o Dr. Shazia Arshad o Dr. Muhammad Aslam o Dr. Muhammad Awais Hassan • Associate Professors: o Dr. Muhammad Junaid Arshad o Dr. Tauqir Ahmad o Dr. Amjad Farooq • Assistant Professors: o Dr. Talha Waheed o Dr. Syed Khaldoon Khurshid o Dr. Amna Zafar o Dr. Faiza Iqbal o Dr. Ayesha Altaf o Dr. Samyan Qayyum Wahla o Dr. Maida Shahid o Dr. Atif Hussain o Dr. Abqa Javed 7",
  "Institute of Data Science - Introduction: : The M.Sc. Data Science program has been initialized in the Department of Computer Science with a vision to understand and process data/information in the modern era. The institute expects graduate- level students to acquire knowledge ranging from fundamental concepts to advanced levels of data science, focusing on customizing the collection of local data to solve problems with a data-driven approach.",
  "Institute of Data Science - Eligibility Criteria: : • M.Sc. Data Science: Sixteen-year education with terminal degree in Computing (any related domains) or terminal degree suitable for Data Science. Suitability determined by PGRC.",
  "Institute of Data Science - Faculty Members: : • Director: Prof. Dr. Shazia Arshad • Assistant Professor: Dr. Faiza Iqbal • Teaching Assistant: Miss. Fatima Shafiq • Graduate Assistants: Miss Hijab Zehra Zaidi, Miss Amna Adnan",
  "Department of Computer Engineering - Introduction: : The Department of Computer Engineering was established as an independent department in 2020. It was originally part of the Department of Computer Science and Engineering. The department offers Ph.D., M.Sc., and B.Sc. degree programs in Computer Engineering and B.Sc. in Cyber Security.",
  "Department of Computer Engineering - Offered Programs: : • Ph.D. Computer Engineering • M.Sc. Computer Engineering",
  "Department of Computer Engineering - Eligibility Criteria: : • M.Sc. Computer Engineering: Four years B.S./B.Sc. degree in Computer (Systems) Engineering, Software Engineering, Computer Science, Electronic Engineering, Electrical Engineering, Telecommunication Engineering, Artificial Intelligence, Information Technology, or a four-year degree in any other related discipline.",
  "Department of Computer Engineering - Faculty Members: : • Professors: o Dr. Muhammad Shoaib (Dean) 8 o Dr. Ali Hammad Akbar (Chairman) o Dr. Muhammad Shahbaz • Associate Professors: o Dr. Yasir Saleem o Dr. Faisal Hayat • Assistant Professors: o Dr. Muhammad Asim Rehmat o Dr. Fareed Ud Din Mehmood Jafari o Dr. Beenish Ayesha Akram o Dr. Sahar Waqar",
  "Department of Mechanical Engineering - Introduction: : The Department of Mechanical Engineering has the distinction of being one of the oldest disciplines since 1923 when this institution came into being as \"Maclagan Engineering College\". In 1961, when the institution was upgraded to an independent Engineering University, Master's and Doctorate programs were introduced.",
  "Department of Mechanical Engineering - Offered Programs: : • Ph.D. Mechanical Engineering • M.Sc. Mechanical Design Engineering • M.Sc. Thermal Power Engineering • M.Sc. Renewable Energy Systems Engineering • M.Sc. Railway Engineering • M.Sc. Engineering Project Management • M.Sc. Mechanical Fluid Engineering (New Campus)",
  "Department of Mechanical Engineering - Eligibility Criteria: : • M.Sc. Thermal Power Engineering: B.Sc. Mechanical Engineering, Mechatronics & Control Engg, Automotive Engg, Aerospace Engg, Chemical Engg, or Energy System Engg. • M.Sc. Mechanical Design Engineering: B.Sc. Mechanical Engg, Industrial & Manufacturing Engg, Automotive Engg, Aerospace Engg, or Mechatronics & Control Engg. • M.Sc. Renewable Energy Systems Engineering: B.Sc. Mechanical Engg, Renewable Energy/Energy Systems Engg, Electrical Engg, Chemical Engg, or Environmental Engg. 9 • M.Sc. Railway Engineering: B.Sc. Mechanical, Electrical, Civil, Mechatronics, or Industrial & Manufacturing Engineering. • M.Sc. Engineering Project Management: Four years Bachelor's Degree in Engineering, Engineering Technology, Computer Science, CRP, or Architecture.",
  "Department of Mechanical Engineering - Faculty Members: : • Professors: o Dr. Nasir Hayat (Pro Vice Chancellor) o Dr. Tauseef Aized Khan (Dean) o Dr. Asad Naeem Shah (Chairman) o Dilshad Hussain (Emeritus) o Dr. Muhammad Asif Mahmood Qureshi o Dr. Amjad Hussain o Dr. Ghulam Moeen ud Din o Dr. M. Mahmood Aslam Bhutta o Dr. Muhammad Asim • Associate Professors: o Dr. Awais Ahmad Khan o Dr. Muhammad Usman o Dr. Zia ul Rehman Tahir o Dr. Jamal Umar • Assistant Professors: o Dr. Naseer Ahmad o Dr. Jafar Hussain o Dr. Jawad Sarwar o Dr. Syed Nadeem Abbas Shah o Dr. Muhammad Zubair Sheikh o Dr. Muhammad Waqar Nasir o Dr. Talha Khan o Dr. Hafiz Zahid Nabi • Lecturers: o Dr. Syed Wasim Hasan Zubair o Dr. Rehmat Bashir o Dr. Hibbah Akhtar 10 6. Automotive Engineering Centre",
  "Department of Mechanical Engineering - Introduction: : The Automotive Engineering Centre was initiated in 2005 to contribute to the automotive engineering field through research and innovation. A wide variety of Research, Development & Consultancy facilities are available at the Centre to support educational and industrial requirements.",
  "Department of Mechanical Engineering - Offered Programs: : • Ph.D. Automotive Engineering • M.Sc. Automotive Engineering",
  "Department of Mechanical Engineering - Eligibility Criteria: : • M.Sc. Automotive Engineering: B.Sc. Mechanical Engineering, Automotive Engineering, Mechatronics and Control Engineering, Industrial and Manufacturing Engineering, Aerospace Engineering, or Energy Engineering.",
  "Department of Mechanical Engineering - Faculty Members: : • Professors: o Dr. Tauseef Aized Khan (Dean) o Dr. Amjad Hussain • Associate Professors: o Dr. Ali Hussain Kazim (Director) • Assistant Professors: o Dr. Hasan Izhar Khan o Dr. Saad Jahangir o Dr. Muhammad Ali Shahbaz • Lecturers: o Dr. Adeel Shehzad 11",
  "Department of Industrial & Manufacturing Engineering - Introduction: : The Postgraduate Program of the Department is well established and offers M.Sc. and Ph.D. degrees in two specializations: Engineering Management & Manufacturing Engineering. The program has earned its credibility over the years due to its updated curriculum designed according to industrial requirements and technological advancements.",
  "Department of Industrial & Manufacturing Engineering - Offered Programs: : • Ph.D. Manufacturing Engineering • Ph.D. Engineering Management • M.Sc. Manufacturing Engineering • M.Sc. Engineering Management",
  "Department of Industrial & Manufacturing Engineering - Eligibility Criteria: : • M.Sc. Engineering Management: Any B.Sc. Engineering Degree. • M.Sc. Manufacturing Engineering: Bachelor's degree in Industrial & Manufacturing Engg, Mechatronics & Control Engg, Mechanical Engg, Automotive Engg, Metallurgical & Materials Engg, Polymer & Process Engg, Textile Engg, Aerospace Engg, or relevant degree.",
  "Department of Industrial & Manufacturing Engineering - Faculty Members: : • Professors: o Dr. Tauseef Aized (Dean) o Dr. Nadeem Ahmad Mufti (Emeritus) o Dr. Muhammad Qaiser Saleem (Chairman) • Associate Professors: o Dr. Kashif Ishfaq o Dr. Sarmad Ali Khan o Dr. Sadaf Zahoor (On Leave) • Assistant Professors: o Dr. Rakhshanda Naveed o Dr. Syed Farhan Raza Rizvi o Dr. Muhammad Faisal Shahzad o Dr. Sana Ehsan • Lecturers: o Dr. Kiran Mughal 12",
  "Department of Mechatronics & Control Engineering - Introduction: : The fast dynamics of modern technology called for merging electronics engineering with mechanical engineering into a new discipline called \"Mechatronics\". Mechatronics is the synergistic combination of precision mechanical engineering, electronics, control engineering, and computer science aimed at solving complex engineering problems.",
  "Department of Mechatronics & Control Engineering - Offered Programs: : • Ph.D. Mechatronics Engineering • M.Sc. Mechatronics Engineering",
  "Department of Mechatronics & Control Engineering - Eligibility Criteria: : • M.Sc. Mechatronics Engineering: B.Sc. Mechatronics, Mechanical, Industrial & Manufacturing, Electrical/Electronic, Computer, Aeronautical, Aerospace/Avionics, Automotive, or Biomedical Engineering.",
  "Department of Mechatronics & Control Engineering - Faculty Members: : • Professors: o Dr. Tauseef Aized (Dean) o Dr. Waqar Mahmood • Associate Professors: o Dr. Ali Raza (Chairman) o Dr. Mohsin Rizwan o Dr. M. Ahsan o Dr. Syed Abbas Zilqurnain Naqvi • Assistant Professors: o Dr. Maria Akram o Dr. Ayisha Nayyar o Dr. Muhammad Ahsan Naeem o Dr. Maliha Saleem Bakhshi • Lecturers: o Dr. Muhammad Rzi Abbas 13",
  "Department of Civil Engineering - Introduction: : The Department of Civil Engineering is one of the oldest departments in the country, established in 1939 as a part of the Maclagan Engineering College, Lahore. Currently, it has an enrolment of over 1000 students in bachelor, Master, and Ph.D. programs. The department has a strong alumni backup of more than 8000 alumni.",
  "Department of Civil Engineering - Offered Programs: : • Ph.D. Civil Engineering • M.Sc. Structural Engineering • M.Sc. Geotechnical Engineering • M.Sc. Hydraulics & Irrigation Engineering • M.Sc. Disaster Mitigation Engineering",
  "Department of Civil Engineering - Eligibility Criteria: : • M.Sc. Structural Engineering: [Implied B.Sc. Civil Engineering or relevant as per departmental PGRC, standard M.Sc. Civil requirement]. • M.Sc. Disaster Mitigation Engineering: 16 years education in Civil, Architectural, Transportation, Environmental, Geological, Petroleum, or Mining Engineering.",
  "Department of Civil Engineering - Faculty Members: : • Professors: o Dr. Khalid Farooq (Dean) o Dr. Noor Muhammad Khan (Chairman) o Dr. Asad Ullah Qazi o Dr. Asif Hameed o Dr. M. Burhan Sharif o Dr. Rashid Hameed o Dr. Hassan Mujtaba Shahzad o Dr. Abdul Sattar Shakir (Emeritus) o Dr. Habib Ur Rehman (Emeritus) • Associate Professors: o Dr. Muhammad Azhar Saleem o Dr. Safeer Abbas o Dr. Qasim Shaukat Khan o Dr. Ali Ahmed 14 o Dr. Nauman Khurram o Dr. Jahanzaib Israr o Dr. Muhammad Irfan-ul-Hassan o Dr. Wasim Abbas o Dr. Rizwan Azam o Dr. Muhammad Mazhar Saleem o Dr. M. Rizwan Riaz o Dr. Syed Asad Ali Gillani o Dr. Usman Akmal • Assistant Professors: o Dr. Imtiaz Rashid o Dr. Muhammad Yousaf o Dr. Umbreen us Sahar o Dr. Aqsa Shabbir o Dr. Muhammad Ali Falak o Dr. Muhammad Kashif o Dr. Ehtesham Mehmood (On Leave) o Engr. Usman Ali • Lecturers: o Dr. Ubaid Ahmed Mughal",
  "Department of Transportation Engineering & Management - Introduction: : Established under the Faculty of Civil Engineering in 2002, this Department aimed to produce transportation engineers capable of planning, designing, constructing, managing, operating, and maintaining various modes of transportation. It has the distinction of being the first department in Pakistan to offer a formal M.Sc. Degree course in Transportation Informatics.",
  "Department of Transportation Engineering & Management - Offered Programs: : • Ph.D. Transportation Engineering • M.Sc. Transportation Engineering • M.Sc. Transportation Informatics 15",
  "Department of Transportation Engineering & Management - Eligibility Criteria: : • M.Sc. Transportation Engineering: B.Sc. in Transportation Engineering, Civil Engineering, or Urban Engineering. • M.Sc. Transportation Informatics: 16 years education (B.Sc./M.Sc.) in Computer Science, or B.Sc. in Computer Engineering or Transportation Engineering.",
  "Department of Transportation Engineering & Management - Faculty Members: : • Professors: o Dr. Khalid Farooq (Dean) o Dr. Zia-ur-Rehman (Chairman) o Dr. Ammad Hassan Khan • Associate Professors: o Dr. Abdur Rahim • Assistant Professors: o Dr. Izza Anwer o Dr. Hina Saleemi o Dr. Saadia Tabassum o Dr. Mujassim Ali Rizvi o Dr. Bilal Zia Malik",
  "Institute of Environmental Engineering & Research - Introduction: : Established in 1972 as a post-graduate research institute, it is the premier educational institution in the field of Environmental Engineering in Pakistan. It is also one of the oldest and most reliable organizations providing commercial testing services in water, wastewater, and air.",
  "Institute of Environmental Engineering & Research - Offered Programs: : • Ph.D. Environmental Engineering • Ph.D. Environmental Sciences • M.Sc. Environmental Engineering • M.Phil. Environmental Sciences 16",
  "Institute of Environmental Engineering & Research - Eligibility Criteria: : • M.Sc. Environmental Engineering: B.Sc. in Civil, Chemical, Environmental, Transportation, Mechanical Engineering, or Architectural Engineering & Design. • M.Phil. Environmental Sciences: 16 years of education (BS/MSc) in Environmental Science, Chemistry, Biochemistry, Zoology, Botany, Agricultural Sciences, B.Sc. Environmental Engg, Civil Engg, or Chemical Engg.",
  "Institute of Environmental Engineering & Research - Faculty Members: : • Professors: o Dr. Khalid Farooq (Dean) o Dr. Amir Ikhlaq (Director) o Dr. Javed Anwar Aziz (Emeritus) • Associate Professors: o Dr. Muhammad Umar Farooq o Dr. Muhammad Irfan Jalees o Dr. Mehwish Anis o Dr. Ghulam Hussain • Assistant Professors: o Dr. Fizza Zahid • Lecturers: o Dr. Gul-E-Hina",
  "Department of Architectural Engineering & Design - Introduction: : Established in 2001, this department holds the distinction of being the pioneer of the Architectural Engineering discipline in the country. The primary objective is to provide high-quality education and prepare students to become successful professionals equipped with innovative, interdisciplinary approaches tailored to the evolving demands of the construction sector.",
  "Department of Architectural Engineering & Design - Offered Programs: : • Ph.D. Architectural Engineering • M.Sc. Integrated Building Design • M.Sc. Construction Management • M.Sc. Building Engineering 17",
  "Department of Architectural Engineering & Design - Eligibility Criteria: : • M.Sc. Construction Management: B.Sc. Architectural, Civil, Transportation, Construction Management, City and Regional Planning, or Bachelor of Architecture. • M.Sc. Integrated Building Design: B.Sc. Architectural Engineering & Design, Civil Engineering, or Bachelor of Architecture.",
  "Department of Architectural Engineering & Design - Faculty Members: : • Professors: o Dr. Khalid Farooq (Dean) o Dr. Khuram Rashid (Chairman) o Dr. Sajjad Mubin • Associate Professors: o Dr. Maria Idrees • Assistant Professors: o Dr. Nasir Javed o Dr. Ahmad Riaz o Dr. Sidra Jamshed • Lecturers: o Dr. Anam Fatima o Mr. H. Abrar Ahmad o Dr. Abdul Mueed Iqbal o Dr. Huda Riaz o Ms. Afia Razzaq o Ms. Khadija Mawra",
  "Center of Excellence in Water Resources Engineering - Introduction: : Established in 1976 under the Presidential Act, the Centre was primarily established with the objectives of high-level goal-oriented teaching and research in water resources. These objectives are being followed by imparting M.Sc. and Ph.D. degrees and conducting specialized training programs.",
  "Center of Excellence in Water Resources Engineering - Offered Programs: : • Ph.D. Engineering Hydrology 18 • Ph.D. Water Resources Engineering • Ph.D. Water Resources Management • M.Sc. Water Resources Engineering • M.Sc. Water Resources Management • M.Sc. Engineering Hydrology • M.Sc. Hydro Power Engineering",
  "Center of Excellence in Water Resources Engineering - Eligibility Criteria: : • M.Sc. Engineering Hydrology: B.Sc. or equivalent (16 years) in Civil, Agricultural, Geological Engineering; Civil/Agricultural Technology; Hydrology, Applied Geology, GIS, Forestry, Soil/Environmental Sciences, etc. • M.Sc. Water Resources Management: B.Sc. or equivalent (16 years) in Agricultural, Civil, Geological Engineering; Applied Geology, Computer Science, Agricultural/Civil Technology, Forestry, Water Resources Mgmt, Soil Science, Environmental Engineering, etc.",
  "Center of Excellence in Water Resources Engineering - Faculty Members: : • Professors: o Dr. Khalid Farooq (Dean) o Dr. Muhammad Atiq Ur Rehman Tariq (Director) • Associate Professors: o Dr. Muhammad Kaleem Sarwar o Dr. Ghulam Nabi o Dr. Muhammad Waseem • Assistant Professors: o Dr. Muhammad Masood o Dr. Mudassar Iqbal o Dr. Zaheer Muhammad Malik o Dr. Amjad Masood",
  "Department of Chemical Engineering - Introduction: : Established in 1962, it is the first institution in the Country to offer B.Sc., M.Sc., and Ph.D. degree programs in Chemical Engineering. The Department started the M.Sc. Chemical Engineering degree program in 1970. 19",
  "Department of Chemical Engineering - Offered Programs: : • Ph.D. Chemical Engineering • M.Sc. Chemical Engineering • M.Sc. Safety, Health and Environment (New Campus)",
  "Department of Chemical Engineering - Eligibility Criteria: : • M.Sc. Chemical Engineering: [Standard requirement: B.Sc. Chemical Engineering]. • M.Sc. Safety, Health and Environment: B.Sc. Engineering, B.Sc. Engineering Technology, M.Sc./B.Sc. (Hon.) 16-years education in Biological/Earth/Environmental/Life/Natural/Physical Sciences, or MBBS.",
  "Department of Chemical Engineering - Faculty Members: : • Professors: o Dr. Naveed Ramzan (Dean) o Dr. Hafiz Muhammad Zaheer Aslam (Chairman) o Dr. Saima Yasin (On Leave) • Associate Professors: o Dr. Farhan Javed o Dr. Muhammad Asif Akhtar o Dr. Muhammad Azam Saeed o Dr. Muhammad Faheem o Dr. Umair Aslam o Dr. Usman Ali (On Leave) • Assistant Professors: o Dr. Ayesha Irshad o Dr. Farhan Ahmad o Dr. Hirra Anjum o Dr. Humayun Wali o Dr. Muhammad Wasim Tahir o Dr. Saira Bano o Dr. Umer Afzal 20",
  "Department of Polymer & Process Engineering - Introduction: : The undergraduate program was launched in 2002 under the Polymer Engineering Division of the Department of Chemical Engineering. In January 2006, the university upgraded the division into an independent degree-awarding department. The postgraduate degree program was started in 2007.",
  "Department of Polymer & Process Engineering - Offered Programs: : • Ph.D. Polymer Science and Engineering • M.Sc. Polymer & Process Engineering • M.Phil. Polymer Science and Technology",
  "Department of Polymer & Process Engineering - Eligibility Criteria: : • M.Sc. Polymer & Process Engineering: 16 years education in Polymer Engineering or Chemical Engineering. • M.Phil. Polymer Science & Technology: 16 years education in Polymer Engg, Chemical Engg, Materials Science & Engg, Physics, Chemistry, or Mechanical Engineering.",
  "Department of Polymer & Process Engineering - Faculty Members: : • Professors: o Dr. Ing. Naveed Ramzan (Dean) o Dr. Asif Ali Qaiser (Chairman) o Dr. Farhan Saeed o Dr. Atif Javaid • Associate Professors: o Dr. Muhammad Sarfraz o Dr. Yasir Qayyum Gill o Dr. Rabia Nazar o Dr. Umar Mehmood • Assistant Professors: o Dr. Muhammad Farooq o Dr. Muhammad Aamir o Dr. Zaman Tahir (IPFP Fellow) 21",
  "Department of Metallurgical & Materials Engineering - Introduction: : Established in 1965, it has the distinction of being one of the oldest institutions in the country to offer bachelor's and master's degrees in Metallurgy. The Master's degree program was started in 1978 and focuses not only on theory but also on research.",
  "Department of Metallurgical & Materials Engineering - Offered Programs: : • Ph.D. Metallurgical and Materials Engineering • M.Sc. Metallurgical & Materials Engineering • M.Sc. Surface Science & Engineering • M.Sc. Materials Science (New)",
  "Department of Metallurgical & Materials Engineering - Eligibility Criteria: : • M.Sc. Metallurgical and Materials Engineering: B.Sc. in Metallurgical and Materials Engg, Chemical Engg, Polymer Engg, Mechanical Engg, or Industrial and Manufacturing Engg. • M.Sc. Surface Science & Engineering: B.Sc. in Metallurgical and Materials Engg, Chemical Engg, Polymer Engg, Mechanical Engg, or Industrial and Manufacturing Engg.",
  "Department of Metallurgical & Materials Engineering - Faculty Members: : • Professors: o Dr. Ing. Naveed Ramzan (Dean) o Dr. Muhammad Asif Rafiq (Chairman) o Dr.-Ing. Furqan Ahmed • Associate Professors: o Dr. Ehsan-ul-Haq o Dr. Adnan Maqbool • Assistant Professors: o Dr.-Ing. Muhammad Zubair o Dr.-Ing. Khushnuda Nur o Dr.-Ing. Amjad Ali • Lecturers: o Dr. Syed Farrukh Alam Zaidi 22",
  "Department of Mining Engineering - Introduction: : Established in 1954 as part of the Maclagan Engineering College, it is one of the oldest and best mining schools in the region. The postgraduate program in Mining Engineering started in 1976.",
  "Department of Mining Engineering - Offered Programs: : • Ph.D. Mining Engineering • M.Sc. Mining Engineering • M.Sc. Tunneling & Underground Excavation Engineering • M.Sc. Mineral Processing",
  "Department of Mining Engineering - Eligibility Criteria: : • M.Sc. Mining Engineering: B.Sc. in Mining, Geological, Civil, or Petroleum and Gas Engineering. • M.Sc. Tunneling & Underground Excavation Engineering: B.Sc. in Mining, Geological, or Civil Engineering.",
  "Department of Mining Engineering - Faculty Members: : • Professors: o Dr. Tauseef Aized (Dean) o Dr. Zulfiqar Ali o Dr. Yasir Majeed • Associate Professors: o Dr. Muhammad Azeem Raza • Assistant Professors: o Dr. Shahab Saqib (Chairman) o Dr. Muhammad Badar Hayat o Dr. Muhammad Usman Khan o Dr. Muhammad Shahzad",
  "Department of Geological Engineering - Introduction: : In 2009, the Department started its graduate programs in two disciplines: M.Sc. Geological Engineering and M.Sc. Geological Sciences. These programs are designed for students who 23 have the aptitude for pursuing higher education in rock engineering, geotechnical engineering, and exploration of natural energy resources.",
  "Department of Geological Engineering - Offered Programs: : • Ph.D. Geological Engineering • M.Sc. Geological Engineering • M.Sc. Geological Sciences",
  "Department of Geological Engineering - Eligibility Criteria: : • M.Sc. Geological Engineering: B.Sc. Geological, Mining, Petroleum & Gas, or Civil Engineering. • M.Sc. Geological Sciences: B.S. Geology or M.Sc. Geology (16 years), or B.Sc. Geological/Mining/Petroleum/Civil Engineering.",
  "Department of Geological Engineering - Faculty Members: : • Professors: o Dr. Muhammad Farooq Ahmed (Chairman) • Associate Professors: o Dr. Muhammad Arshad o Dr. Ghulam Mohyuddin Sohail • Assistant Professors: o Dr. Hafiz Muhammad Awai Rashid o Dr. Sadia Ismail",
  "Department of Petroleum & Gas Engineering - Introduction: : The Department has the distinction of being the pioneer in the country to offer a degree program in Petroleum Engineering. The program at UET Lahore has been ranked (51-100) in the world by the prestigious QS Ranking by subject.",
  "Department of Petroleum & Gas Engineering - Offered Programs: : • Ph.D. Petroleum and Gas Engineering • M.Sc. Petroleum & Gas Engineering",
  "Department of Petroleum & Gas Engineering - Eligibility Criteria: : • M.Sc. Petroleum & Gas Engineering: B.Sc. Petroleum and Gas, Geological, Mining, Chemical, Civil, or Mechanical Engineering. 24",
  "Department of Petroleum & Gas Engineering - Faculty Members: : • Prof. Dr. Muhammad Khurram Zahoor (Chairperson) • (Full faculty list not explicitly detailed in prospectus text, please refer to departmental website).",
  "Department of Architecture - Introduction: : Established in 1962, the Department holds the distinction of being the first institution in Pakistan to offer a Bachelor's degree in Architecture. It continues to maintain its leadership by offering advanced academic programs, including the Master of Architecture (M.Arch) and Ph.D. in Architecture.",
  "Department of Architecture - Offered Programs: : • Ph.D. in Architecture • Master of Architecture (M.Arch.)",
  "Department of Architecture - Eligibility Criteria: : • Master of Architecture (M.Arch.): Bachelor of Architecture, B.Sc. Architectural Engineering & Design, City & Regional Planning, or Civil Engineering.",
  "Department of Architecture - Faculty Members: : • Dr. Munazza Akhtar (Chairperson) • (Refer to department for full faculty list).",
  "Department of City & Regional Planning - Introduction: : This department has been contributing to nation-building through its graduates since 1962. It is an advanced planning institution in Pakistan, offering top-quality education in City and Regional Planning, Community Development, and Disaster Management.",
  "Department of City & Regional Planning - Offered Programs: : • Ph.D. City and Regional Planning • M.Sc. City & Regional Planning • M.Sc. Community Development and Environmental Management • M.Sc. Disaster Management • Master in Real Estate Planning and Management 25",
  "Department of City & Regional Planning - Eligibility Criteria: : • M.Sc. City & Regional Planning: B.Sc. City & Regional Planning, Civil Engineering, or Bachelor of Architecture. • M.Sc. Community Development: B.Sc. CRP, Civil, Transportation, Environmental Engg, Product & Industrial Design, Architecture, Environmental Sciences, Sociology, Geography, Economics, GIS, etc. • M.Sc. Disaster Management: M.Sc./B.Sc. Honors in Disaster Management, Earth/Environmental/Space/Biological/Management/Agriculture/Medical Sciences, Economics, Sociology, Psychology, Engineering (Civil/Electrical/Mech/Chem/Mining/Geo), CRP, Product Design, Architecture. • Master in Real Estate Planning and Management: 16-years bachelor's degree in CRP, Product & Industrial Design, Architecture, Engineering Sciences, Business Management, Social Sciences, GIS.",
  "Department of City & Regional Planning - Faculty Members: : • Prof. Dr. Shaker Mahmood Mayo (Chairperson) • (Refer to department for full faculty list).",
  "Department of Product & Industrial Design - Introduction: : Established in 2006 in UET Main Campus with a vision to address emerging challenges in the field of design. In 2016, the department marked a major milestone by introducing postgraduate studies in Product and Industrial Design.",
  "Department of Product & Industrial Design - Offered Programs: : • Master in Product and Industrial Design (M.PID)",
  "Department of Product & Industrial Design - Eligibility Criteria: : • M.PID: B.Sc. in Product and Industrial Design, Product Design, Industrial Design, Interior Design, Multimedia Design, Communication Design, Textile Design, Graphic Design, Architecture, or CRP.",
  "Department of Product & Industrial Design - Faculty Members: : • Associate Professors: o Dr.-Ing. Atif Bilal Aslam (Chairman) • Assistant Professors: o Dr. Salman Asghar 26",
  "Department of Chemistry - Introduction: : The Department started the M.Phil. Applied Chemistry degree program in 2001 and the Ph.D. Chemistry degree program in 2004. Further, M.Phil. in Food Science & Technology was started in 2018. It also offers Applied Chemistry courses to undergraduate degree programs of Engineering disciplines.",
  "Department of Chemistry - Offered Programs: : • Ph.D. Chemistry • M.Phil. Applied Chemistry • M.Phil. Food Science and Technology",
  "Department of Chemistry - Eligibility Criteria: : • M.Phil. Food Science and Technology: 16-years degree in Food Science and Technology, Chemistry, Biochemistry, Agricultural Chemistry, or Biotechnology. • M.Phil. Applied Chemistry: [Implied 16 years education in Chemistry/Applied Chemistry].",
  "Department of Chemistry - Faculty Members: : • Prof. Dr. Farhat Yasmeen (Chairperson) • (Department lists 215 enrolled M.Phil students and 38 Ph.D. students).",
  "Department of Mathematics - Introduction: : The Department of Mathematics provides an environment to learn foundations, applications, and creative approaches related to mathematical and engineering problems, thus contributing to research services for science and engineering.",
  "Department of Mathematics - Offered Programs: : • Ph.D. Mathematics • M.Phil. Applied Mathematics",
  "Department of Physics - Introduction: : The Department offers M.Phil. Applied Physics, M.Phil. Nanoscience and Technology, and Ph.D. Physics. It has produced 37 Ph.D., 627 M.Phil., and 466 M.Sc. Physics students so far. It has three fully equipped Advanced Research Centers including the Centre for Nanotechnology and Advanced Material Research.",
  "Department of Physics - Offered Programs: : • Ph.D. Physics • M.Phil. Applied Physics • M.Phil. Nano Science and Technology",
  "Department of Physics - Eligibility Criteria: : • M.Phil. Nano Science and Technology: 16-years degree in Physics, Chemistry, or B.Sc. Engineering (Electrical, Chemical, Metallurgical, Polymer). • M.Phil. Polymer Science & Technology (Interdisciplinary): 16-years degree in Chemistry, Physics, Chemical Engg, Polymer Engg, Mechanical Engg, or Materials Science.",
  "Department of Physics - Faculty Members: : • Prof. Dr. Rehana Sharif (Chairperson) • Prof. Dr. Muhammad Shahid Rafique (Dean)",
  "Department of Islamic Studies - Introduction: : The Department offers postgraduate programs including Ph.D. and M.Phil. in Islamic Studies. It also offers a BS in Islamic Studies with Computer Technology, a pioneering interdisciplinary program designed to harmonize deep-rooted Islamic scholarship with cutting-edge technological expertise.",
  "Department of Islamic Studies - Offered Programs: : • Ph.D. Islamic Studies • M.Phil. Islamic Studies",
  "Department of Islamic Studies - Eligibility Criteria: : • M.Phil. Islamic Studies: 16-years bachelor's degree in Islamic Studies or M.A. in Islamic Studies.",
  "Department of Islamic Studies - Faculty Members: : • Professors: o Prof. Dr. Muhammad Shoaib (Dean/Chairman) 28 o Prof. Dr. Hafiz Muhammad Shahbaaz • Associate Professors: o Dr. Muhammad Nadeem Shah o Dr. Atiq ur Rehman o Dr. Hafiz Zahid Latif o Dr. Tanveer Qasim • Assistant Professors: o Dr. Hafiz Qudratullah o Ms. Gul Saria Ashraf (Ex-Pakistan Leave) • Lecturers: o Hafiz M Naeem o Saif ul Islam",
  "Institute of Business and Management - Offered Programs: : • Ph.D. Business Administration and Management • MBA (30 CH) • MBA (60 CH) • Executive MBA • MS Management • MS Marketing",
  "Institute of Business and Management - Eligibility Criteria: : • Executive MBA: 16-years bachelor's degree in any discipline with 3 years professional experience. • MBA (30 CH): 16-years bachelor's degree in relevant discipline. • MBA (60 CH): 16-years bachelor's degree in any discipline. • MS Management: 16-years bachelor's degree in relevant discipline.",
  "Institute of Business and Management - Faculty Members: : • Professors: o Dr. Muhammad Shahid Rafique (Dean) o Dr. Muhammad Nasir Malik (Director) 29 • Assistant Professors: o Dr. Amir Ikram o Dr. Asma Abdul Rehman o Dr. Farah Samreen o Dr. Farman Afzal o Dr. Mehreen Waheed o Dr. Mishal Ahmad o Dr. Muhammad Shoaib Farooq o Dr. Naeem Akhtar o Dr. Rabia Naseem • Lecturers: o Dr. Maria Khan o Dr. Qurat ul Ain Akhtar o Dr. Rizwana Hameed o Dr. Sadaf Razzaq 30"
]